package ru.siksmfp.basic.language.labmdas.my;

/**
 * @author Artem Karnov @date 17.02.2017.
 * artem.karnov@t-systems.com
 */

public class TODO {
    // TODO: 17.02.2017 H2 база с родителями и т.п.
    // TODO: 17.02.2017 Среднее число женщин в компании
    // TODO: 17.02.2017 Компания с наибольшим количеством работников
    // TODO: 17.02.2017 Средняя зарплата по стране
    // TODO: 17.02.2017 Детей какого поло больше
    // TODO: 17.02.2017 Самая многочисленная семья
    // TODO: 17.02.2017 Детей какого пола больше и на сколько
    // TODO: 17.02.2017 Optional parent
    // TODO: 17.02.2017 hash and equals в методе по умолчанию
    // TODO: 17.02.2017 Родители у которых есть или мальчик или девочка
    // TODO: 17.02.2017 Создать что-нибудь дефолтовое
    // TODO: 17.02.2017 Создать функциональный интерфейс для министерства по контролю за родителями
    // TODO: 17.02.2017 Перегружаемые методы с ляпбдами
    // TODO: 17.02.2017 Что-то вроду дебагера на лямбдах
    // TODO: 17.02.2017 Самое длинное имя гражданина
    // TODO: 17.02.2017 Среднее количество гласных в именах граждан
    // TODO: 17.02.2017 Через чистые функции (принимают и отдают функции) понаделать родителей
    // TODO: 17.02.2017 Показ всех работников всех компаний
    // TODO: 17.02.2017 Показать все семьи
    // TODO: 17.02.2017 Найти ту семью, которая больше всего получает денег
    // TODO: 17.02.2017 Уволить всех из одной компании и компанию удалить
    // TODO: 17.02.2017 Найти самого молодого и самого старого человека
    // TODO: 17.02.2017 Своя реализация map
    // TODO: 17.02.2017 Своя реализация reduce
    // TODO: 17.02.2017 Своя реализация collect
    // TODO: 17.02.2017 Своя реализация filter
}
